"Data is messy"
We will be performing the following operation on our Onion price to refine it.

1. Remove e.g. remove redundant data from the data frame
2. Parse e.g. extract date from year and month column

### Importing essential libraries

In [16]:
import numpy as np
import pandas as pd

### Reading the DataFrame

In [17]:
df = pd.read_excel('MonthWiseMarketArrivals_Chennai.xlsx')

In [18]:
df.head(10)

    market      month  year  quantity  priceMin  priceMax  priceMod
0  CHENNAI    January  2004    103400       798      1019       910
1  CHENNAI   February  2004     87800       776       969       873
2  CHENNAI      March  2004    102180       506       656       580
3  CHENNAI      April  2004     83300       448       599       527
4  CHENNAI        May  2004     84850       462       596       529
5  CHENNAI       June  2004     97100       480       619       555
6  CHENNAI       July  2004     95200       502       627       566
7  CHENNAI     August  2004    100600       527       711       618
8  CHENNAI  September  2004     98200       411       633       529
9  CHENNAI    October  2004    111200       429       608       522

In [19]:
df.shape

(209, 7)

### Checking for null values and removing it

In [20]:
df.isna().sum()

market      0
month       0
year        0
quantity    0
priceMin    0
priceMax    0
priceMod    0
dtype: int64

In [21]:
df.dropna(inplace = True)

In [22]:
df.dtypes

market      object
month       object
year         int64
quantity     int64
priceMin     int64
priceMax     int64
priceMod     int64
dtype: object

### Changing the datatypes for integer values

In [23]:
df.iloc[:,2:7] = df.iloc[:,2:7].astype(int)

In [24]:
df.dtypes

market      object
month       object
year         int32
quantity     int32
priceMin     int32
priceMax     int32
priceMod     int32
dtype: object

In [25]:
df.describe()

              year       quantity     priceMin      priceMax     priceMod
count   209.000000     209.000000   209.000000    209.000000   209.000000
mean   2012.215311  109775.416268  1461.177033   1815.736842  1643.909091
std       5.043708   15999.821163  1158.614525   1331.778237  1244.599869
min    2004.000000   63000.000000   304.000000    456.000000   384.000000
25%    2008.000000  100500.000000   755.000000   1013.000000   883.000000
50%    2012.000000  110200.000000  1092.000000   1457.000000  1263.000000
75%    2017.000000  119900.000000  1800.000000   2204.000000  1980.000000
max    2021.000000  150400.000000  8696.000000  11130.000000  9876.000000

### Finding the dates

In [26]:
df["date"] = df["month"] + "-" + df["year"].map(str)
df.head()

,market,month,year,quantity,priceMin,priceMax,priceMod,date
0,CHENNAI,January,2004,103400,798,1019,910,January-2004
1,CHENNAI,February,2004,87800,776,969,873,February-2004
2,CHENNAI,March,2004,102180,506,656,580,March-2004
3,CHENNAI,April,2004,83300,448,599,527,April-2004
4,CHENNAI,May,2004,84850,462,596,529,May-2004

In [27]:
index = pd.to_datetime(df.date)
df.date = pd.DatetimeIndex(df.date)
df.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            199, 200, 201, 202, 203, 204, 205, 206, 207, 208],
           dtype='int64', length=209)

In [28]:
df.head(10)

    market      month  year  quantity  priceMin  priceMax  priceMod       date
0  CHENNAI    January  2004    103400       798      1019       910 2004-01-01
1  CHENNAI   February  2004     87800       776       969       873 2004-02-01
2  CHENNAI      March  2004    102180       506       656       580 2004-03-01
3  CHENNAI      April  2004     83300       448       599       527 2004-04-01
4  CHENNAI        May  2004     84850       462       596       529 2004-05-01
5  CHENNAI       June  2004     97100       480       619       555 2004-06-01
6  CHENNAI       July  2004     95200       502       627       566 2004-07-01
7  CHENNAI     August  2004    100600       527       711       618 2004-08-01
8  CHENNAI  September  2004     98200       411       633       529 2004-09-01
9  CHENNAI    October  2004    111200       429       608       522 2004-10-01

### Saving the cleaned Dataframe

In [29]:
df.to_csv('MonthWiseMarketArrivals_ChennaiCleaned.csv', index = False)